In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
sns.set(style="whitegrid")

In [3]:
df = pd.read_csv('IRIS.csv')
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [6]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

## Exploratory Data Analytics (EDA)

In [11]:
df['species'].value_counts()

Iris-versicolor    50
Iris-setosa        50
Iris-virginica     50
Name: species, dtype: int64

In [12]:
df.shape

(150, 5)

# Deep Dive to Pandas

In [14]:
data = [0,0.2,0.25,0.5,0.75]
np_data = np.array(data)
ser_data = pd.Series(data)

In [15]:
ser_data

0    0.00
1    0.20
2    0.25
3    0.50
4    0.75
dtype: float64

In [23]:
data2 = {'Name':['Adi', 'Gesang', 'Indar', 'Nur','Rafli'],
'Age':[27, 34, 22, 30, 25],
'Address':['Jakarta', 'Bandung', 'Medan', 'Surabaya', 'Medan'],
'Qualification':['Msc', 'BSc', 'MCA', 'Phd', 'Phd']}
df = pd.DataFrame(data2)
df

     Name  Age   Address Qualification
0     Adi   27   Jakarta           Msc
1  Gesang   34   Bandung           BSc
2   Indar   22     Medan           MCA
3     Nur   30  Surabaya           Phd
4   Rafli   25     Medan           Phd

In [24]:
#Memilih 2 kolom
df[['Name','Qualification']]

     Name Qualification
0     Adi           Msc
1  Gesang           BSc
2   Indar           MCA
3     Nur           Phd
4   Rafli           Phd

In [25]:
#Memilih baris
df.loc[(df.Address == 'Medan') & (df.Age > 20)]

    Name  Age Address Qualification
2  Indar   22   Medan           MCA
4  Rafli   25   Medan           Phd

In [28]:
df.iloc[[0,3,4]]

    Name  Age   Address Qualification
0    Adi   27   Jakarta           Msc
3    Nur   30  Surabaya           Phd
4  Rafli   25     Medan           Phd

In [36]:
df.iloc[1:5,1:3]

   Age   Address
1   34   Bandung
2   22     Medan
3   30  Surabaya
4   25     Medan